reversing/reversing-keygen.org
#+TITLE: Reversing a simple keygen with rizin
#+AUTHOR: 8dcc
#+OPTIONS: toc:nil
#+STARTUP: showeverything
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../css/main.css" />

[[file:../index.org][Index]] | [[file:index.org][Up]]

-----

#+TOC: headlines 2

* Introduction

I created a simple keygen program that takes a user and a key, and prints a
message if the key is valid. Let's try to figure out how to make a keygen for
it. I made an article explaining how keygens work, and how to make your own. I
will not be using the same code, but feel free to check [[file:../programming/creating-keygen.org][Creating a simple keygen]]
in case you are interested.

* Trying out the program

First, let's try running the program to see what it's asking.

#+begin_example
Username: test
Key: test
Invalid key.
#+end_example

From this, we can at least expect:
- A call to something like =printf()= with ="Username:"= in the arguments.
- Some call for scanning the username, perhaps =getchar()=, =gets()= or =scanf()=.
- Another call to =printf()= with ="Key:"= in the arguments.
- Another call for scanning the key.
- Some kind of key validation.
- Depending on the result, a last call to =printf()= with the text ="Invalid key."=.

* The main function

Let's start by having a look at the main function with [[https://rizin.re/][rizin]] 0.6.3 (you can also
use [[https://cutter.re][cutter]] or [[https://hex-rays.com/ida-pro/][IDA]], if you prefer a GUI program).

** Finding the main function

We start by running the =aaa= rizin command, which is used to "Analyze all calls,
references, emulation and apply signatures".

#+begin_src nasm
$ rizin ./my_keygen
[0x000010a0]> aaa
[x] Analyze all flags starting with sym. and entry0 (aa)
[x] Analyze function calls
[x] Analyze len bytes of instructions for references
[x] Check for classes
[x] Analyze local variables and arguments
[x] Type matching analysis for all functions
[x] Applied 0 FLIRT signatures via sigdb
[x] Propagate noreturn information
[x] Resolve pointers to data sections
[x] Use -AA or aaaa to perform additional experimental analysis.
#+end_src

We can list the symbols (flags) with =fl=. In this case, rizin couldn't find the
=main= function.

#+begin_quote
*Note:* With =command~text=, we can filter rizin's output.
#+end_quote

#+begin_src nasm
[0x000010a0]> fl~main
0x00003fc0 8 reloc.__libc_start_main
0x00004080 8 reloc.target.__libc_start_main
#+end_src

This is not a problem, though, since we can just print the entry point of the
program with =pdf= (print disassembly of function) to determine where our main
function is.

#+begin_quote
*Note:* Using =command@location= executes the command at that position. In this
case, rizin has placed us into =entry0= already, so this is not necessary. We
could also use =s location= (seek) and then =command=.
#+end_quote

#+begin_src nasm
[0x000010a0]> pdf @ entry0
│         entry0                      ;-- section..text:
┌         entry0                     entry0(int64_t arg3);
│         entry0                     ; arg int64_t arg3 @ rdx
│         entry0                          31 ed                       xor   ebp, ebp                ; [13] -r-x section size 1492 named .text
│         entry0+0x2                      49 89 d1                    mov   r9, rdx                 ; arg3
│         entry0+0x5                      5e                          pop   rsi
│         entry0+0x6                      48 89 e2                    mov   rdx, rsp
│         entry0+0x9                      48 83 e4 f0                 and   rsp, 0xfffffffffffffff0
│         entry0+0xd                      50                          push  rax
│         entry0+0xe                      54                          push  rsp
│         entry0+0xf                      45 31 c0                    xor   r8d, r8d
│         entry0+0x12                     31 c9                       xor   ecx, ecx
│         entry0+0x14                     48 8d 3d 4e 03 00 00        lea   rdi, data.00001409      ; 0x1409
└         entry0+0x1b                     ff 15 ff 2e 00 00           call  qword reloc.__libc_start_main ; [reloc.__libc_start_main:8]=0x4080 reloc.target.__libc_start_main
[0x000010a0]>
#+end_src

