reversing/reversing-keygen.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Reversing a simple keygen with rizin</title>
<meta name="author" content="8dcc" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Reversing a simple keygen with rizin</h1>
<p>
<a href="../index.html">Index</a> | <a href="index.html">Up</a>
</p>

<hr />

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3cdb5e1">1. Introduction</a></li>
<li><a href="#org1de97e4">2. Trying out the program</a></li>
<li><a href="#orgf8524d7">3. The main function</a>
<ul>
<li><a href="#org1a85c9a">3.1. Finding the main function</a></li>
<li><a href="#org31ed883">3.2. Disassembling the main function</a></li>
</ul>
</li>
<li><a href="#org4e95567">4. Disassembling the key generator</a></li>
<li><a href="#org87d87b5">5. Alternative: Decompiling with IDA or ghidra</a>
<ul>
<li><a href="#orga4e213b">5.1. IDA Pro</a></li>
<li><a href="#org2859a44">5.2. Rizin's version of ghidra</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3cdb5e1" class="outline-2">
<h2 id="org3cdb5e1"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
I created a simple keygen program that takes a user and a key, and prints a
message if the key is valid. Let's try to figure out how to make a keygen for
it. I made an article explaining how keygens work, and how to make your own. I
will not be using the same code, but feel free to check <a href="../programming/creating-keygen.html">Creating a simple keygen</a>
in case you are interested.
</p>
</div>
</div>

<div id="outline-container-org1de97e4" class="outline-2">
<h2 id="org1de97e4"><span class="section-number-2">2.</span> Trying out the program</h2>
<div class="outline-text-2" id="text-2">
<p>
First, let's try running the program to see what it's asking.
</p>

<pre class="example" id="orged3363b">
Username: test
Key: test
Invalid key.
</pre>

<p>
From this, we can at least expect:
</p>
<ul class="org-ul">
<li>A call to something like <code>printf()</code> with <code>"Username:"</code> in the arguments.</li>
<li>Some call for scanning the username, perhaps <code>getchar()</code>, <code>gets()</code> or <code>scanf()</code>.</li>
<li>Another call to <code>printf()</code> with <code>"Key:"</code> in the arguments.</li>
<li>Another call for scanning the key.</li>
<li>Some kind of key validation.</li>
<li>Depending on the result, a last call to <code>printf()</code> with the text <code>"Invalid key."</code>.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf8524d7" class="outline-2">
<h2 id="orgf8524d7"><span class="section-number-2">3.</span> The main function</h2>
<div class="outline-text-2" id="text-3">
<p>
Let's start by having a look at the main function with <a href="https://rizin.re/">rizin</a> 0.6.3 (you can also
use <a href="https://cutter.re">cutter</a> or <a href="https://hex-rays.com/ida-pro/">IDA</a>, if you prefer a GUI program).
</p>
</div>

<div id="outline-container-org1a85c9a" class="outline-3">
<h3 id="org1a85c9a"><span class="section-number-3">3.1.</span> Finding the main function</h3>
<div class="outline-text-3" id="text-3-1">
<p>
We start by running the <code>aaa</code> rizin command, which is used to "Analyze all calls,
references, emulation and apply signatures".
</p>

<div class="org-src-container">
<pre class="src src-nasm">$ rizin ./my_keygen
[<span style="color: #88ca9f;">0x000010a0</span>]&gt; <span style="color: #feacd0;">aaa</span>
[x] Analyze all flags starting with sym. <span style="color: #feacd0;">and</span> entry0 (aa)
[x] Analyze function calls
[x] Analyze len bytes of instructions for references
[x] Check for classes
[x] Analyze local variables <span style="color: #feacd0;">and</span> arguments
[x] Type matching analysis for all functions
[x] Applied <span style="color: #88ca9f;">0</span> FLIRT signatures via sigdb
[x] Propagate noreturn information
[x] Resolve pointers <span style="color: #79a8ff;">to</span> data sections
[x] Use -AA <span style="color: #feacd0;">or</span> aaaa <span style="color: #79a8ff;">to</span> perform additional experimental analysis.
</pre>
</div>

<p>
We can list the symbols (flags) with <code>fl</code>. In this case, rizin couldn't find the
<code>main</code> function.
</p>

<blockquote>
<p>
<b>Note:</b> With <code>command~text</code>, we can filter rizin's output.
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-nasm">[<span style="color: #88ca9f;">0x000010a0</span>]&gt; fl~main
<span style="color: #88ca9f;">0x00003fc0</span> <span style="color: #88ca9f;">8</span> reloc.__libc_start_main
<span style="color: #88ca9f;">0x00004080</span> <span style="color: #88ca9f;">8</span> reloc.target.__libc_start_main
</pre>
</div>

<p>
This is not a problem, though, since we can just print the entry point of the
program with <code>pdf</code> (print disassembly of function) to determine where our main
function is.
</p>

<blockquote>
<p>
<b>Note:</b> Using <code>command@location</code> executes the command at that position. In this
case, rizin has placed us into <code>entry0</code> already, so this is not necessary. We
could also use <code>s location</code> (seek) and then <code>command</code>.
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-nasm">[<span style="color: #88ca9f;">0x000010a0</span>]&gt; pdf @ entry0
&#9474;         entry0                      <span style="color: #989898;">;</span><span style="color: #989898;">-- section..text:</span>
&#9484;         entry0                     entry0(int64_t arg3)<span style="color: #989898;">;</span>
&#9474;         entry0                     <span style="color: #989898;">; </span><span style="color: #989898;">arg int64_t arg3 @ rdx</span>
&#9474;         entry0                          <span style="color: #88ca9f;">31</span> ed                       <span style="color: #feacd0;">xor</span>   <span style="color: #6ae4b9;">ebp</span>, <span style="color: #6ae4b9;">ebp</span>                <span style="color: #989898;">; </span><span style="color: #989898;">[13] -r-x section size 1492 named .text</span>
&#9474;         entry0+<span style="color: #88ca9f;">0x2</span>                      <span style="color: #88ca9f;">49</span> <span style="color: #88ca9f;">89</span> d1                    <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">r9</span>, <span style="color: #6ae4b9;">rdx</span>                 <span style="color: #989898;">; </span><span style="color: #989898;">arg3</span>
&#9474;         entry0+<span style="color: #88ca9f;">0x5</span>                      <span style="color: #88ca9f;">5e</span>                          <span style="color: #feacd0;">pop</span>   <span style="color: #6ae4b9;">rsi</span>
&#9474;         entry0+<span style="color: #88ca9f;">0x6</span>                      <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">89</span> e2                    <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">rdx</span>, <span style="color: #6ae4b9;">rsp</span>
&#9474;         entry0+<span style="color: #88ca9f;">0x9</span>                      <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">83</span> e4 f0                 <span style="color: #feacd0;">and</span>   <span style="color: #6ae4b9;">rsp</span>, <span style="color: #88ca9f;">0xfffffffffffffff0</span>
&#9474;         entry0+<span style="color: #88ca9f;">0xd</span>                      <span style="color: #88ca9f;">50</span>                          <span style="color: #feacd0;">push</span>  <span style="color: #6ae4b9;">rax</span>
&#9474;         entry0+<span style="color: #88ca9f;">0xe</span>                      <span style="color: #88ca9f;">54</span>                          <span style="color: #feacd0;">push</span>  <span style="color: #6ae4b9;">rsp</span>
&#9474;         entry0+<span style="color: #88ca9f;">0xf</span>                      <span style="color: #88ca9f;">45</span> <span style="color: #88ca9f;">31</span> c0                    <span style="color: #feacd0;">xor</span>   <span style="color: #6ae4b9;">r8d</span>, <span style="color: #6ae4b9;">r8d</span>
&#9474;         entry0+<span style="color: #88ca9f;">0x12</span>                     <span style="color: #88ca9f;">31</span> c9                       <span style="color: #feacd0;">xor</span>   <span style="color: #6ae4b9;">ecx</span>, <span style="color: #6ae4b9;">ecx</span>
&#9474;         entry0+<span style="color: #88ca9f;">0x14</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">8d</span> <span style="color: #88ca9f;">3d</span> <span style="color: #88ca9f;">4e</span> <span style="color: #88ca9f;">03</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span>        <span style="color: #feacd0;">lea</span>   <span style="color: #6ae4b9;">rdi</span>, data.00001409      <span style="color: #989898;">; </span><span style="color: #989898;">0x1409</span>
&#9492;         entry0+<span style="color: #88ca9f;">0x1b</span>                     ff <span style="color: #88ca9f;">15</span> ff <span style="color: #88ca9f;">2e</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span>           <span style="color: #feacd0;">call</span>  <span style="color: #79a8ff;">qword</span> reloc.__libc_start_main <span style="color: #989898;">; </span><span style="color: #989898;">[reloc.__libc_start_main:8]=0x4080 reloc.target.__libc_start_main</span>
[<span style="color: #88ca9f;">0x000010a0</span>]&gt;
</pre>
</div>
</div>
</div>
