reversing/reversing-keygen.org
** Disassembling the main function

The address being loaded into =rdi= at =entry0+0x14= should be our main function. Let's have a look.

#+begin_comment
TODO: (pdf @ data.00001409) Doesn't recognize it as a function, you have to use
      (pd 100 @ data.00001409) instead.
#+end_comment

#+begin_src nasm
[0x000010a0]> pd 60 @ data.00001409
          ; DATA XREF from entry0 @ 0x10b4
          main                      ;-- data.00001409:
          main                      ;-- main:
          main                          55                          push  rbp
          main+0x1                      48 89 e5                    mov   rbp, rsp
          main+0x4                      48 83 ec 10                 sub   rsp, 0x10
          main+0x8                      48 8d 05 f1 0b 00 00        lea   rax, str.Username:        ; 0x2009 ; "Username: "
          main+0xf                      48 89 c7                    mov   rdi, rax
          main+0x12                     b8 00 00 00 00              mov   eax, 0
          main+0x17                     e8 3b fc ff ff              call  sym.imp.printf            ; sym.imp.printf ; int printf(const char *format)
          main+0x1c                     48 8d 05 34 2c 00 00        lea   rax, [0x00004060]
          main+0x23                     48 89 c6                    mov   rsi, rax
          main+0x26                     48 8d 05 de 0b 00 00        lea   rax, str.255s             ; 0x2014 ; "%255s"
          main+0x2d                     48 89 c7                    mov   rdi, rax
          main+0x30                     b8 00 00 00 00              mov   eax, 0
          main+0x35                     e8 3d fc ff ff              call  sym.imp.__isoc99_scanf    ; sym.imp.__isoc99_scanf ; int scanf(const char *format)
          main+0x3a                     48 8d 05 d0 0b 00 00        lea   rax, str.Key:             ; 0x201a ; "Key: "
          main+0x41                     48 89 c7                    mov   rdi, rax
          main+0x44                     b8 00 00 00 00              mov   eax, 0
          main+0x49                     e8 09 fc ff ff              call  sym.imp.printf            ; sym.imp.printf ; int printf(const char *format)
          main+0x4e                     48 8d 05 02 2d 00 00        lea   rax, [0x00004160]
          main+0x55                     48 89 c7                    mov   rdi, rax
          main+0x58                     e8 41 fe ff ff              call  fcn.000012a7              ; fcn.000012a7
          main+0x5d                     48 8d 05 13 2d 00 00        lea   rax, [0x00004180]
          main+0x64                     48 89 c6                    mov   rsi, rax
          main+0x67                     48 8d 05 e9 2b 00 00        lea   rax, [0x00004060]
          main+0x6e                     48 89 c7                    mov   rdi, rax
          main+0x71                     e8 06 fd ff ff              call  fcn.00001185              ; fcn.00001185
          main+0x76                     ba 14 00 00 00              mov   edx, 0x14
          main+0x7b                     48 8d 05 f5 2c 00 00        lea   rax, [0x00004180]
          main+0x82                     48 89 c6                    mov   rsi, rax
          main+0x85                     48 8d 05 cb 2c 00 00        lea   rax, [0x00004160]
          main+0x8c                     48 89 c7                    mov   rdi, rax
          main+0x8f                     e8 d3 fb ff ff              call  sym.imp.memcmp            ; sym.imp.memcmp ; int memcmp(const void *s1, const void *s2, size_t n)
          main+0x94                     85 c0                       test  eax, eax
          main+0x96                     0f 94 c0                    sete  al
          main+0x99                     88 45 ff                    mov   byte [rbp - 1], al
          main+0x9c                     80 7d ff 00                 cmp   byte [rbp - 1], 0
      ┌─< main+0xa0                     74 11                       je    0x14bc
      │   main+0xa2                     48 8d 05 6e 0b 00 00        lea   rax, str.Correct_key.     ; 0x2020 ; "Correct key."
      │   main+0xa9                     48 89 c7                    mov   rdi, rax
      │   main+0xac                     e8 76 fb ff ff              call  sym.imp.puts              ; sym.imp.puts ; int puts(const char *s)
     ┌──< main+0xb1                     eb 0f                       jmp   0x14cb
     │└─> main+0xb3                     48 8d 05 6a 0b 00 00        lea   rax, str.Invalid_key.     ; 0x202d ; "Invalid key."
     │    main+0xba                     48 89 c7                    mov   rdi, rax
     │    main+0xbd                     e8 65 fb ff ff              call  sym.imp.puts              ; sym.imp.puts ; int puts(const char *s)
     │    ; CODE XREF from data.00001409 @ +0xb1
     └──> main+0xc2                     b8 00 00 00 00              mov   eax, 0
          main+0xc7                     c9                          leave
          main+0xc8                     c3                          ret
#+end_src

#+begin_quote
*Note:* I renamed this function to "main" with =f+ main 0x9c @ data.00001409=.
#+end_quote

In here, we can see that it matches the pattern we saw when running the program.
From =main+0x8= to =main+0x17=, it calls =printf("Username: ")=, and from =main+0x1c= to
=main+0x35= it uses =scanf("%255s", user)= to read the user, where /user/ is at
address =0x4060=.

Similarly, from =main+0x3a= to =main+0x49= it calls =printf("Key: ")=, but instead of
calling =scanf()=, from =main+0x4e= to =main+0x58= it calls an unknown function at
=0x12a7= with =0x4160= as argument. We can safely asume that it scans for the user
key, so we will rename the function to =get_key()=, and the parameter =user_key=.

From =main+0x5d= to =main+0x71=, it calls an unknown function at =0x1185= with the
=user= we got from =scanf()= and =0x4180= as arguments. This looks very promising,
since it will compare this =0x4180= value with =user_key= right bellow. For this
reason, we will call this function =generate_key()= and the second parameter at
=0x4180=, =real_key=.

From =main+0x76= to =main+0xbd= it calls =memcmp(user_key, real_key, 0x14)= and prints
"Correct key." or "Invalid key." depending on the returned value by =memcmp=. From
this call we also know that the key size should be 0x14 (20).

This is obviously an ideal environment, since the main function is the one
responsible for validating the key. Since this is not normally the case, we
could try to look for those success and fail messages in the program's string
list, and checking the xrefs to find the key validation function. In this
specific program, we could also just patch the bytes to either show us the real
key, or change the conditional jump so it always jumps to the code that gets
executed when the key is correct.

