reversing/reversing-keygen.html

<div id="outline-container-org31ed883" class="outline-3">
<h3 id="org31ed883"><span class="section-number-3">3.2.</span> Disassembling the main function</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The address being loaded into <code>rdi</code> at <code>entry0+0x14</code> should be our main function. Let's have a look.
</p>

<div class="org-src-container">
<pre class="src src-nasm">[<span style="color: #88ca9f;">0x000010a0</span>]&gt; pd <span style="color: #88ca9f;">60</span> @ data.00001409
          <span style="color: #989898;">; </span><span style="color: #989898;">DATA XREF from entry0 @ 0x10b4</span>
          main                      <span style="color: #989898;">;</span><span style="color: #989898;">-- data.00001409:</span>
          main                      <span style="color: #989898;">;</span><span style="color: #989898;">-- main:</span>
          main                          <span style="color: #88ca9f;">55</span>                          <span style="color: #feacd0;">push</span>  <span style="color: #6ae4b9;">rbp</span>
          main+<span style="color: #88ca9f;">0x1</span>                      <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">89</span> e5                    <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">rbp</span>, <span style="color: #6ae4b9;">rsp</span>
          main+<span style="color: #88ca9f;">0x4</span>                      <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">83</span> ec <span style="color: #88ca9f;">10</span>                 <span style="color: #feacd0;">sub</span>   <span style="color: #6ae4b9;">rsp</span>, <span style="color: #88ca9f;">0x10</span>
          main+<span style="color: #88ca9f;">0x8</span>                      <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">8d</span> <span style="color: #88ca9f;">05</span> f1 <span style="color: #88ca9f;">0b</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span>        <span style="color: #feacd0;">lea</span>   <span style="color: #6ae4b9;">rax</span>, str.Username:        <span style="color: #989898;">; </span><span style="color: #989898;">0x2009 ; "Username: "</span>
          main+<span style="color: #88ca9f;">0xf</span>                      <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">89</span> c7                    <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">rdi</span>, <span style="color: #6ae4b9;">rax</span>
          main+<span style="color: #88ca9f;">0x12</span>                     b8 <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span>              <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">eax</span>, <span style="color: #88ca9f;">0</span>
          main+<span style="color: #88ca9f;">0x17</span>                     e8 <span style="color: #88ca9f;">3b</span> fc ff ff              <span style="color: #feacd0;">call</span>  sym.imp.printf            <span style="color: #989898;">; </span><span style="color: #989898;">sym.imp.printf ; int printf(const char *format)</span>
          main+<span style="color: #88ca9f;">0x1c</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">8d</span> <span style="color: #88ca9f;">05</span> <span style="color: #88ca9f;">34</span> <span style="color: #88ca9f;">2c</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span>        <span style="color: #feacd0;">lea</span>   <span style="color: #6ae4b9;">rax</span>, [<span style="color: #88ca9f;">0x00004060</span>]
          main+<span style="color: #88ca9f;">0x23</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">89</span> c6                    <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">rsi</span>, <span style="color: #6ae4b9;">rax</span>
          main+<span style="color: #88ca9f;">0x26</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">8d</span> <span style="color: #88ca9f;">05</span> de <span style="color: #88ca9f;">0b</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span>        <span style="color: #feacd0;">lea</span>   <span style="color: #6ae4b9;">rax</span>, str.255s             <span style="color: #989898;">; </span><span style="color: #989898;">0x2014 ; "%255s"</span>
          main+<span style="color: #88ca9f;">0x2d</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">89</span> c7                    <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">rdi</span>, <span style="color: #6ae4b9;">rax</span>
          main+<span style="color: #88ca9f;">0x30</span>                     b8 <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span>              <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">eax</span>, <span style="color: #88ca9f;">0</span>
          main+<span style="color: #88ca9f;">0x35</span>                     e8 <span style="color: #88ca9f;">3d</span> fc ff ff              <span style="color: #feacd0;">call</span>  sym.imp.__isoc99_scanf    <span style="color: #989898;">; </span><span style="color: #989898;">sym.imp.__isoc99_scanf ; int scanf(const char *format)</span>
          main+<span style="color: #88ca9f;">0x3a</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">8d</span> <span style="color: #88ca9f;">05</span> d0 <span style="color: #88ca9f;">0b</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span>        <span style="color: #feacd0;">lea</span>   <span style="color: #6ae4b9;">rax</span>, str.Key:             <span style="color: #989898;">; </span><span style="color: #989898;">0x201a ; "Key: "</span>
          main+<span style="color: #88ca9f;">0x41</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">89</span> c7                    <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">rdi</span>, <span style="color: #6ae4b9;">rax</span>
          main+<span style="color: #88ca9f;">0x44</span>                     b8 <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span>              <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">eax</span>, <span style="color: #88ca9f;">0</span>
          main+<span style="color: #88ca9f;">0x49</span>                     e8 <span style="color: #88ca9f;">09</span> fc ff ff              <span style="color: #feacd0;">call</span>  sym.imp.printf            <span style="color: #989898;">; </span><span style="color: #989898;">sym.imp.printf ; int printf(const char *format)</span>
          main+<span style="color: #88ca9f;">0x4e</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">8d</span> <span style="color: #88ca9f;">05</span> <span style="color: #88ca9f;">02</span> <span style="color: #88ca9f;">2d</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span>        <span style="color: #feacd0;">lea</span>   <span style="color: #6ae4b9;">rax</span>, [<span style="color: #88ca9f;">0x00004160</span>]
          main+<span style="color: #88ca9f;">0x55</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">89</span> c7                    <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">rdi</span>, <span style="color: #6ae4b9;">rax</span>
          main+<span style="color: #88ca9f;">0x58</span>                     e8 <span style="color: #88ca9f;">41</span> fe ff ff              <span style="color: #feacd0;">call</span>  fcn.000012a7              <span style="color: #989898;">; </span><span style="color: #989898;">fcn.000012a7</span>
          main+<span style="color: #88ca9f;">0x5d</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">8d</span> <span style="color: #88ca9f;">05</span> <span style="color: #88ca9f;">13</span> <span style="color: #88ca9f;">2d</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span>        <span style="color: #feacd0;">lea</span>   <span style="color: #6ae4b9;">rax</span>, [<span style="color: #88ca9f;">0x00004180</span>]
          main+<span style="color: #88ca9f;">0x64</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">89</span> c6                    <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">rsi</span>, <span style="color: #6ae4b9;">rax</span>
          main+<span style="color: #88ca9f;">0x67</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">8d</span> <span style="color: #88ca9f;">05</span> e9 <span style="color: #88ca9f;">2b</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span>        <span style="color: #feacd0;">lea</span>   <span style="color: #6ae4b9;">rax</span>, [<span style="color: #88ca9f;">0x00004060</span>]
          main+<span style="color: #88ca9f;">0x6e</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">89</span> c7                    <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">rdi</span>, <span style="color: #6ae4b9;">rax</span>
          main+<span style="color: #88ca9f;">0x71</span>                     e8 <span style="color: #88ca9f;">06</span> fd ff ff              <span style="color: #feacd0;">call</span>  fcn.00001185              <span style="color: #989898;">; </span><span style="color: #989898;">fcn.00001185</span>
          main+<span style="color: #88ca9f;">0x76</span>                     ba <span style="color: #88ca9f;">14</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span>              <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">edx</span>, <span style="color: #88ca9f;">0x14</span>
          main+<span style="color: #88ca9f;">0x7b</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">8d</span> <span style="color: #88ca9f;">05</span> f5 <span style="color: #88ca9f;">2c</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span>        <span style="color: #feacd0;">lea</span>   <span style="color: #6ae4b9;">rax</span>, [<span style="color: #88ca9f;">0x00004180</span>]
          main+<span style="color: #88ca9f;">0x82</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">89</span> c6                    <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">rsi</span>, <span style="color: #6ae4b9;">rax</span>
          main+<span style="color: #88ca9f;">0x85</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">8d</span> <span style="color: #88ca9f;">05</span> cb <span style="color: #88ca9f;">2c</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span>        <span style="color: #feacd0;">lea</span>   <span style="color: #6ae4b9;">rax</span>, [<span style="color: #88ca9f;">0x00004160</span>]
          main+<span style="color: #88ca9f;">0x8c</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">89</span> c7                    <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">rdi</span>, <span style="color: #6ae4b9;">rax</span>
          main+<span style="color: #88ca9f;">0x8f</span>                     e8 d3 fb ff ff              <span style="color: #feacd0;">call</span>  sym.imp.memcmp            <span style="color: #989898;">; </span><span style="color: #989898;">sym.imp.memcmp ; int memcmp(const void *s1, const void *s2, size_t n)</span>
          main+<span style="color: #88ca9f;">0x94</span>                     <span style="color: #88ca9f;">85</span> c0                       <span style="color: #feacd0;">test</span>  <span style="color: #6ae4b9;">eax</span>, <span style="color: #6ae4b9;">eax</span>
          main+<span style="color: #88ca9f;">0x96</span>                     <span style="color: #88ca9f;">0f</span> <span style="color: #88ca9f;">94</span> c0                    <span style="color: #feacd0;">sete</span>  <span style="color: #6ae4b9;">al</span>
          main+<span style="color: #88ca9f;">0x99</span>                     <span style="color: #88ca9f;">88</span> <span style="color: #88ca9f;">45</span> ff                    <span style="color: #feacd0;">mov</span>   <span style="color: #79a8ff;">byte</span> [<span style="color: #6ae4b9;">rbp</span> - <span style="color: #88ca9f;">1</span>], <span style="color: #6ae4b9;">al</span>
          main+<span style="color: #88ca9f;">0x9c</span>                     <span style="color: #88ca9f;">80</span> <span style="color: #88ca9f;">7d</span> ff <span style="color: #88ca9f;">00</span>                 <span style="color: #feacd0;">cmp</span>   <span style="color: #79a8ff;">byte</span> [<span style="color: #6ae4b9;">rbp</span> - <span style="color: #88ca9f;">1</span>], <span style="color: #88ca9f;">0</span>
      &#9484;&#9472;&lt; main+<span style="color: #88ca9f;">0xa0</span>                     <span style="color: #88ca9f;">74</span> <span style="color: #88ca9f;">11</span>                       <span style="color: #feacd0;">je</span>    <span style="color: #88ca9f;">0x14bc</span>
      &#9474;   main+<span style="color: #88ca9f;">0xa2</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">8d</span> <span style="color: #88ca9f;">05</span> <span style="color: #88ca9f;">6e</span> <span style="color: #88ca9f;">0b</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span>        <span style="color: #feacd0;">lea</span>   <span style="color: #6ae4b9;">rax</span>, str.Correct_key.     <span style="color: #989898;">; </span><span style="color: #989898;">0x2020 ; "Correct key."</span>
      &#9474;   main+<span style="color: #88ca9f;">0xa9</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">89</span> c7                    <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">rdi</span>, <span style="color: #6ae4b9;">rax</span>
      &#9474;   main+<span style="color: #88ca9f;">0xac</span>                     e8 <span style="color: #88ca9f;">76</span> fb ff ff              <span style="color: #feacd0;">call</span>  sym.imp.puts              <span style="color: #989898;">; </span><span style="color: #989898;">sym.imp.puts ; int puts(const char *s)</span>
     &#9484;&#9472;&#9472;&lt; main+<span style="color: #88ca9f;">0xb1</span>                     eb <span style="color: #88ca9f;">0f</span>                       <span style="color: #feacd0;">jmp</span>   <span style="color: #88ca9f;">0x14cb</span>
     &#9474;&#9492;&#9472;&gt; main+<span style="color: #88ca9f;">0xb3</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">8d</span> <span style="color: #88ca9f;">05</span> <span style="color: #88ca9f;">6a</span> <span style="color: #88ca9f;">0b</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span>        <span style="color: #feacd0;">lea</span>   <span style="color: #6ae4b9;">rax</span>, str.Invalid_key.     <span style="color: #989898;">; </span><span style="color: #989898;">0x202d ; "Invalid key."</span>
     &#9474;    main+<span style="color: #88ca9f;">0xba</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">89</span> c7                    <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">rdi</span>, <span style="color: #6ae4b9;">rax</span>
     &#9474;    main+<span style="color: #88ca9f;">0xbd</span>                     e8 <span style="color: #88ca9f;">65</span> fb ff ff              <span style="color: #feacd0;">call</span>  sym.imp.puts              <span style="color: #989898;">; </span><span style="color: #989898;">sym.imp.puts ; int puts(const char *s)</span>
     &#9474;    <span style="color: #989898;">; </span><span style="color: #989898;">CODE XREF from data.00001409 @ +0xb1</span>
     &#9492;&#9472;&#9472;&gt; main+<span style="color: #88ca9f;">0xc2</span>                     b8 <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span>              <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">eax</span>, <span style="color: #88ca9f;">0</span>
          main+<span style="color: #88ca9f;">0xc7</span>                     c9                          <span style="color: #feacd0;">leave</span>
          main+<span style="color: #88ca9f;">0xc8</span>                     c3                          <span style="color: #feacd0;">ret</span>
</pre>
</div>

<blockquote>
<p>
<b>Note:</b> I renamed this function to "main" with <code>f+ main 0x9c @ data.00001409</code>.
</p>
</blockquote>

<p>
In here, we can see that it matches the pattern we saw when running the program.
From <code>main+0x8</code> to <code>main+0x17</code>, it calls <code>printf("Username: ")</code>, and from <code>main+0x1c</code> to
<code>main+0x35</code> it uses <code>scanf("%255s", user)</code> to read the user, where <i>user</i> is at
address <code>0x4060</code>.
</p>

<p>
Similarly, from <code>main+0x3a</code> to <code>main+0x49</code> it calls <code>printf("Key: ")</code>, but instead of
calling <code>scanf()</code>, from <code>main+0x4e</code> to <code>main+0x58</code> it calls an unknown function at
<code>0x12a7</code> with <code>0x4160</code> as argument. We can safely asume that it scans for the user
key, so we will rename the function to <code>get_key()</code>, and the parameter <code>user_key</code>.
</p>

<p>
From <code>main+0x5d</code> to <code>main+0x71</code>, it calls an unknown function at <code>0x1185</code> with the
<code>user</code> we got from <code>scanf()</code> and <code>0x4180</code> as arguments. This looks very promising,
since it will compare this <code>0x4180</code> value with <code>user_key</code> right bellow. For this
reason, we will call this function <code>generate_key()</code> and the second parameter at
<code>0x4180</code>, <code>real_key</code>.
</p>

<p>
From <code>main+0x76</code> to <code>main+0xbd</code> it calls <code>memcmp(user_key, real_key, 0x14)</code> and prints
"Correct key." or "Invalid key." depending on the returned value by <code>memcmp</code>. From
this call we also know that the key size should be 0x14 (20).
</p>

<p>
This is obviously an ideal environment, since the main function is the one
responsible for validating the key. Since this is not normally the case, we
could try to look for those success and fail messages in the program's string
list, and checking the xrefs to find the key validation function. In this
specific program, we could also just patch the bytes to either show us the real
key, or change the conditional jump so it always jumps to the code that gets
executed when the key is correct.
</p>
</div>
</div>
</div>
