reversing/reversing-keygen.org
* Disassembling the key generator

Now that we understand the main logic, let's have a look at the =generate_key()=
function at =0x1185=.

#+begin_src nasm
[0x000010a0]> pdf @ fcn.00001185
          ; CALL XREF from data.00001409 @ +0x71
│         fcn.00001185                      ;-- keygen:
┌         fcn.00001185                     fcn.00001185(const char *arg1, int64_t arg2);
│         fcn.00001185                     ; arg const char *arg1 @ rdi
│         fcn.00001185                     ; arg int64_t arg2 @ rsi
│         fcn.00001185                     ; var int64_t var_38h @ stack - 0x38
│         fcn.00001185                     ; var const char *s @ stack - 0x30
│         fcn.00001185                     ; var int64_t var_19h @ stack - 0x19
│         fcn.00001185                     ; var int64_t var_18h @ stack - 0x18
│         fcn.00001185                     ; var int64_t var_14h @ stack - 0x14
│         fcn.00001185                     ; var int64_t var_10h @ stack - 0x10
│         fcn.00001185                     ; var size_t var_ch @ stack - 0xc
│         fcn.00001185                          55                          push  rbp
│         fcn.00001185+0x1                      48 89 e5                    mov   rbp, rsp
│         fcn.00001185+0x4                      48 83 ec 30                 sub   rsp, 0x30
│         fcn.00001185+0x8                      48 89 7d d8                 mov   qword [rbp - s], rdi ; arg1
│         fcn.00001185+0xc                      48 89 75 d0                 mov   qword [rbp - var_38h], rsi ; arg2
│         fcn.00001185+0x10                     48 8b 45 d8                 mov   rax, qword [rbp - s]
│         fcn.00001185+0x14                     48 89 c7                    mov   rdi, rax          ; const char *s
│         fcn.00001185+0x17                     e8 9f fe ff ff              call  sym.imp.strlen    ; sym.imp.strlen ; size_t strlen(const char *s)
│         fcn.00001185+0x1c                     89 45 fc                    mov   dword [rbp - var_ch], eax
│         fcn.00001185+0x1f                     c7 45 f0 00 00 00 00        mov   dword [rbp - var_18h], 0
│         fcn.00001185+0x26                     c7 45 f4 00 00 00 00        mov   dword [rbp - var_14h], 0
│     ┌─< fcn.00001185+0x2d                     e9 93 00 00 00              jmp   0x124a
│    ┌──> fcn.00001185+0x32                     c7 45 f8 00 00 00 00        mov   dword [rbp - var_10h], 0
│   ┌───< fcn.00001185+0x39                     eb 6e                       jmp   0x122e
│  ┌────> fcn.00001185+0x3b                     8b 45 f8                    mov   eax, dword [rbp - var_10h]
│  ╎│╎│   fcn.00001185+0x3e                     48 63 d0                    movsxd rdx, eax
│  ╎│╎│   fcn.00001185+0x41                     48 8b 45 d8                 mov   rax, qword [rbp - s]
│  ╎│╎│   fcn.00001185+0x45                     48 01 d0                    add   rax, rdx
│  ╎│╎│   fcn.00001185+0x48                     0f b6 00                    movzx eax, byte [rax]
│  ╎│╎│   fcn.00001185+0x4b                     88 45 ef                    mov   byte [rbp - var_19h], al
│  ╎│╎│   fcn.00001185+0x4e                     0f b6 45 ef                 movzx eax, byte [rbp - var_19h]
│  ╎│╎│   fcn.00001185+0x52                     c1 e0 04                    shl   eax, 4
│  ╎│╎│   fcn.00001185+0x55                     89 c2                       mov   edx, eax
│  ╎│╎│   fcn.00001185+0x57                     0f b6 45 ef                 movzx eax, byte [rbp - var_19h]
│  ╎│╎│   fcn.00001185+0x5b                     c0 e8 04                    shr   al, 4
│  ╎│╎│   fcn.00001185+0x5e                     09 d0                       or    eax, edx
│  ╎│╎│   fcn.00001185+0x60                     88 45 ef                    mov   byte [rbp - var_19h], al
│  ╎│╎│   fcn.00001185+0x63                     8b 45 f4                    mov   eax, dword [rbp - var_14h]
│  ╎│╎│   fcn.00001185+0x66                     89 c2                       mov   edx, eax
│  ╎│╎│   fcn.00001185+0x68                     0f b6 45 ef                 movzx eax, byte [rbp - var_19h]
│  ╎│╎│   fcn.00001185+0x6c                     31 d0                       xor   eax, edx
│  ╎│╎│   fcn.00001185+0x6e                     88 45 ef                    mov   byte [rbp - var_19h], al
│  ╎│╎│   fcn.00001185+0x71                     8b 45 fc                    mov   eax, dword [rbp - var_ch]
│  ╎│╎│   fcn.00001185+0x74                     89 c2                       mov   edx, eax
│  ╎│╎│   fcn.00001185+0x76                     0f b6 45 ef                 movzx eax, byte [rbp - var_19h]
│  ╎│╎│   fcn.00001185+0x7a                     31 d0                       xor   eax, edx
│  ╎│╎│   fcn.00001185+0x7c                     88 45 ef                    mov   byte [rbp - var_19h], al
│  ╎│╎│   fcn.00001185+0x7f                     8b 45 f0                    mov   eax, dword [rbp - var_18h]
│  ╎│╎│   fcn.00001185+0x82                     8d 50 01                    lea   edx, [rax + 1]
│  ╎│╎│   fcn.00001185+0x85                     89 55 f0                    mov   dword [rbp - var_18h], edx
│  ╎│╎│   fcn.00001185+0x88                     48 63 d0                    movsxd rdx, eax
│  ╎│╎│   fcn.00001185+0x8b                     48 8b 45 d0                 mov   rax, qword [rbp - var_38h]
│  ╎│╎│   fcn.00001185+0x8f                     48 01 c2                    add   rdx, rax
│  ╎│╎│   fcn.00001185+0x92                     0f b6 45 ef                 movzx eax, byte [rbp - var_19h]
│  ╎│╎│   fcn.00001185+0x96                     88 02                       mov   byte [rdx], al
│  ╎│╎│   fcn.00001185+0x98                     83 7d f0 13                 cmp   dword [rbp - var_18h], 0x13
│ ┌─────< fcn.00001185+0x9c                     7e 07                       jle   0x122a
│ │╎│╎│   fcn.00001185+0x9e                     c7 45 f0 00 00 00 00        mov   dword [rbp - var_18h], 0
│ └─────> fcn.00001185+0xa5                     83 45 f8 01                 add   dword [rbp - var_10h], 1
│  ╎│╎│   ; CODE XREF from fcn.00001185 @ 0x11be
│  ╎└───> fcn.00001185+0xa9                     8b 45 f8                    mov   eax, dword [rbp - var_10h]
│  ╎ ╎│   fcn.00001185+0xac                     48 63 d0                    movsxd rdx, eax
│  ╎ ╎│   fcn.00001185+0xaf                     48 8b 45 d8                 mov   rax, qword [rbp - s]
│  ╎ ╎│   fcn.00001185+0xb3                     48 01 d0                    add   rax, rdx
│  ╎ ╎│   fcn.00001185+0xb6                     0f b6 00                    movzx eax, byte [rax]
│  ╎ ╎│   fcn.00001185+0xb9                     84 c0                       test  al, al
│  └────< fcn.00001185+0xbb                     0f 85 7a ff ff ff           jne   0x11c0
│    ╎│   fcn.00001185+0xc1                     83 45 f4 01                 add   dword [rbp - var_14h], 1
│    ╎│   ; CODE XREF from fcn.00001185 @ 0x11b2
│    ╎└─> fcn.00001185+0xc5                     83 7d f4 04                 cmp   dword [rbp - var_14h], 4
│    └──< fcn.00001185+0xc9                     0f 8e 63 ff ff ff           jle   0x11b7
│         fcn.00001185+0xcf                     90                          nop
│         fcn.00001185+0xd0                     90                          nop
│         fcn.00001185+0xd1                     c9                          leave
└         fcn.00001185+0xd2                     c3                          ret
#+end_src

TODO

