reversing/reversing-keygen.html

<div id="outline-container-org4e95567" class="outline-2">
<h2 id="org4e95567"><span class="section-number-2">4.</span> Disassembling the key generator</h2>
<div class="outline-text-2" id="text-4">
<p>
Now that we understand the main logic, let's have a look at the <code>generate_key()</code>
function at <code>0x1185</code>.
</p>

<div class="org-src-container">
<pre class="src src-nasm">[<span style="color: #88ca9f;">0x000010a0</span>]&gt; pdf @ fcn.00001185
          <span style="color: #989898;">; </span><span style="color: #989898;">CALL XREF from data.00001409 @ +0x71</span>
&#9474;         fcn.00001185                      <span style="color: #989898;">;</span><span style="color: #989898;">-- keygen:</span>
&#9484;         fcn.00001185                     fcn.00001185(const char *arg1, int64_t arg2)<span style="color: #989898;">;</span>
&#9474;         fcn.00001185                     <span style="color: #989898;">; </span><span style="color: #989898;">arg const char *arg1 @ rdi</span>
&#9474;         fcn.00001185                     <span style="color: #989898;">; </span><span style="color: #989898;">arg int64_t arg2 @ rsi</span>
&#9474;         fcn.00001185                     <span style="color: #989898;">; </span><span style="color: #989898;">var int64_t var_38h @ stack - 0x38</span>
&#9474;         fcn.00001185                     <span style="color: #989898;">; </span><span style="color: #989898;">var const char *s @ stack - 0x30</span>
&#9474;         fcn.00001185                     <span style="color: #989898;">; </span><span style="color: #989898;">var int64_t var_19h @ stack - 0x19</span>
&#9474;         fcn.00001185                     <span style="color: #989898;">; </span><span style="color: #989898;">var int64_t var_18h @ stack - 0x18</span>
&#9474;         fcn.00001185                     <span style="color: #989898;">; </span><span style="color: #989898;">var int64_t var_14h @ stack - 0x14</span>
&#9474;         fcn.00001185                     <span style="color: #989898;">; </span><span style="color: #989898;">var int64_t var_10h @ stack - 0x10</span>
&#9474;         fcn.00001185                     <span style="color: #989898;">; </span><span style="color: #989898;">var size_t var_ch @ stack - 0xc</span>
&#9474;         fcn.00001185                          <span style="color: #88ca9f;">55</span>                          <span style="color: #feacd0;">push</span>  <span style="color: #6ae4b9;">rbp</span>
&#9474;         fcn.00001185+<span style="color: #88ca9f;">0x1</span>                      <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">89</span> e5                    <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">rbp</span>, <span style="color: #6ae4b9;">rsp</span>
&#9474;         fcn.00001185+<span style="color: #88ca9f;">0x4</span>                      <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">83</span> ec <span style="color: #88ca9f;">30</span>                 <span style="color: #feacd0;">sub</span>   <span style="color: #6ae4b9;">rsp</span>, <span style="color: #88ca9f;">0x30</span>
&#9474;         fcn.00001185+<span style="color: #88ca9f;">0x8</span>                      <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">89</span> <span style="color: #88ca9f;">7d</span> d8                 <span style="color: #feacd0;">mov</span>   <span style="color: #79a8ff;">qword</span> [<span style="color: #6ae4b9;">rbp</span> - s], <span style="color: #6ae4b9;">rdi</span> <span style="color: #989898;">; </span><span style="color: #989898;">arg1</span>
&#9474;         fcn.00001185+<span style="color: #88ca9f;">0xc</span>                      <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">89</span> <span style="color: #88ca9f;">75</span> d0                 <span style="color: #feacd0;">mov</span>   <span style="color: #79a8ff;">qword</span> [<span style="color: #6ae4b9;">rbp</span> - var_<span style="color: #88ca9f;">38h</span>], <span style="color: #6ae4b9;">rsi</span> <span style="color: #989898;">; </span><span style="color: #989898;">arg2</span>
&#9474;         fcn.00001185+<span style="color: #88ca9f;">0x10</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">8b</span> <span style="color: #88ca9f;">45</span> d8                 <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">rax</span>, <span style="color: #79a8ff;">qword</span> [<span style="color: #6ae4b9;">rbp</span> - s]
&#9474;         fcn.00001185+<span style="color: #88ca9f;">0x14</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">89</span> c7                    <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">rdi</span>, <span style="color: #6ae4b9;">rax</span>          <span style="color: #989898;">; </span><span style="color: #989898;">const char *s</span>
&#9474;         fcn.00001185+<span style="color: #88ca9f;">0x17</span>                     e8 <span style="color: #88ca9f;">9f</span> fe ff ff              <span style="color: #feacd0;">call</span>  sym.imp.strlen    <span style="color: #989898;">; </span><span style="color: #989898;">sym.imp.strlen ; size_t strlen(const char *s)</span>
&#9474;         fcn.00001185+<span style="color: #88ca9f;">0x1c</span>                     <span style="color: #88ca9f;">89</span> <span style="color: #88ca9f;">45</span> fc                    <span style="color: #feacd0;">mov</span>   <span style="color: #79a8ff;">dword</span> [<span style="color: #6ae4b9;">rbp</span> - var_ch], <span style="color: #6ae4b9;">eax</span>
&#9474;         fcn.00001185+<span style="color: #88ca9f;">0x1f</span>                     c7 <span style="color: #88ca9f;">45</span> f0 <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span>        <span style="color: #feacd0;">mov</span>   <span style="color: #79a8ff;">dword</span> [<span style="color: #6ae4b9;">rbp</span> - var_<span style="color: #88ca9f;">18h</span>], <span style="color: #88ca9f;">0</span>
&#9474;         fcn.00001185+<span style="color: #88ca9f;">0x26</span>                     c7 <span style="color: #88ca9f;">45</span> f4 <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span>        <span style="color: #feacd0;">mov</span>   <span style="color: #79a8ff;">dword</span> [<span style="color: #6ae4b9;">rbp</span> - var_<span style="color: #88ca9f;">14h</span>], <span style="color: #88ca9f;">0</span>
&#9474;     &#9484;&#9472;&lt; fcn.00001185+<span style="color: #88ca9f;">0x2d</span>                     e9 <span style="color: #88ca9f;">93</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span>              <span style="color: #feacd0;">jmp</span>   <span style="color: #88ca9f;">0x124a</span>
&#9474;    &#9484;&#9472;&#9472;&gt; fcn.00001185+<span style="color: #88ca9f;">0x32</span>                     c7 <span style="color: #88ca9f;">45</span> f8 <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span>        <span style="color: #feacd0;">mov</span>   <span style="color: #79a8ff;">dword</span> [<span style="color: #6ae4b9;">rbp</span> - var_<span style="color: #88ca9f;">10h</span>], <span style="color: #88ca9f;">0</span>
&#9474;   &#9484;&#9472;&#9472;&#9472;&lt; fcn.00001185+<span style="color: #88ca9f;">0x39</span>                     eb <span style="color: #88ca9f;">6e</span>                       <span style="color: #feacd0;">jmp</span>   <span style="color: #88ca9f;">0x122e</span>
&#9474;  &#9484;&#9472;&#9472;&#9472;&#9472;&gt; fcn.00001185+<span style="color: #88ca9f;">0x3b</span>                     <span style="color: #88ca9f;">8b</span> <span style="color: #88ca9f;">45</span> f8                    <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">eax</span>, <span style="color: #79a8ff;">dword</span> [<span style="color: #6ae4b9;">rbp</span> - var_<span style="color: #88ca9f;">10h</span>]
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x3e</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">63</span> d0                    <span style="color: #feacd0;">movsxd</span> <span style="color: #6ae4b9;">rdx</span>, <span style="color: #6ae4b9;">eax</span>
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x41</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">8b</span> <span style="color: #88ca9f;">45</span> d8                 <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">rax</span>, <span style="color: #79a8ff;">qword</span> [<span style="color: #6ae4b9;">rbp</span> - s]
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x45</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">01</span> d0                    <span style="color: #feacd0;">add</span>   <span style="color: #6ae4b9;">rax</span>, <span style="color: #6ae4b9;">rdx</span>
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x48</span>                     <span style="color: #88ca9f;">0f</span> b6 <span style="color: #88ca9f;">00</span>                    <span style="color: #feacd0;">movzx</span> <span style="color: #6ae4b9;">eax</span>, <span style="color: #79a8ff;">byte</span> [<span style="color: #6ae4b9;">rax</span>]
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x4b</span>                     <span style="color: #88ca9f;">88</span> <span style="color: #88ca9f;">45</span> ef                    <span style="color: #feacd0;">mov</span>   <span style="color: #79a8ff;">byte</span> [<span style="color: #6ae4b9;">rbp</span> - var_<span style="color: #88ca9f;">19h</span>], <span style="color: #6ae4b9;">al</span>
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x4e</span>                     <span style="color: #88ca9f;">0f</span> b6 <span style="color: #88ca9f;">45</span> ef                 <span style="color: #feacd0;">movzx</span> <span style="color: #6ae4b9;">eax</span>, <span style="color: #79a8ff;">byte</span> [<span style="color: #6ae4b9;">rbp</span> - var_<span style="color: #88ca9f;">19h</span>]
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x52</span>                     c1 e0 <span style="color: #88ca9f;">04</span>                    <span style="color: #feacd0;">shl</span>   <span style="color: #6ae4b9;">eax</span>, <span style="color: #88ca9f;">4</span>
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x55</span>                     <span style="color: #88ca9f;">89</span> c2                       <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">edx</span>, <span style="color: #6ae4b9;">eax</span>
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x57</span>                     <span style="color: #88ca9f;">0f</span> b6 <span style="color: #88ca9f;">45</span> ef                 <span style="color: #feacd0;">movzx</span> <span style="color: #6ae4b9;">eax</span>, <span style="color: #79a8ff;">byte</span> [<span style="color: #6ae4b9;">rbp</span> - var_<span style="color: #88ca9f;">19h</span>]
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x5b</span>                     c0 e8 <span style="color: #88ca9f;">04</span>                    <span style="color: #feacd0;">shr</span>   <span style="color: #6ae4b9;">al</span>, <span style="color: #88ca9f;">4</span>
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x5e</span>                     <span style="color: #88ca9f;">09</span> d0                       <span style="color: #feacd0;">or</span>    <span style="color: #6ae4b9;">eax</span>, <span style="color: #6ae4b9;">edx</span>
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x60</span>                     <span style="color: #88ca9f;">88</span> <span style="color: #88ca9f;">45</span> ef                    <span style="color: #feacd0;">mov</span>   <span style="color: #79a8ff;">byte</span> [<span style="color: #6ae4b9;">rbp</span> - var_<span style="color: #88ca9f;">19h</span>], <span style="color: #6ae4b9;">al</span>
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x63</span>                     <span style="color: #88ca9f;">8b</span> <span style="color: #88ca9f;">45</span> f4                    <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">eax</span>, <span style="color: #79a8ff;">dword</span> [<span style="color: #6ae4b9;">rbp</span> - var_<span style="color: #88ca9f;">14h</span>]
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x66</span>                     <span style="color: #88ca9f;">89</span> c2                       <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">edx</span>, <span style="color: #6ae4b9;">eax</span>
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x68</span>                     <span style="color: #88ca9f;">0f</span> b6 <span style="color: #88ca9f;">45</span> ef                 <span style="color: #feacd0;">movzx</span> <span style="color: #6ae4b9;">eax</span>, <span style="color: #79a8ff;">byte</span> [<span style="color: #6ae4b9;">rbp</span> - var_<span style="color: #88ca9f;">19h</span>]
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x6c</span>                     <span style="color: #88ca9f;">31</span> d0                       <span style="color: #feacd0;">xor</span>   <span style="color: #6ae4b9;">eax</span>, <span style="color: #6ae4b9;">edx</span>
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x6e</span>                     <span style="color: #88ca9f;">88</span> <span style="color: #88ca9f;">45</span> ef                    <span style="color: #feacd0;">mov</span>   <span style="color: #79a8ff;">byte</span> [<span style="color: #6ae4b9;">rbp</span> - var_<span style="color: #88ca9f;">19h</span>], <span style="color: #6ae4b9;">al</span>
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x71</span>                     <span style="color: #88ca9f;">8b</span> <span style="color: #88ca9f;">45</span> fc                    <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">eax</span>, <span style="color: #79a8ff;">dword</span> [<span style="color: #6ae4b9;">rbp</span> - var_ch]
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x74</span>                     <span style="color: #88ca9f;">89</span> c2                       <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">edx</span>, <span style="color: #6ae4b9;">eax</span>
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x76</span>                     <span style="color: #88ca9f;">0f</span> b6 <span style="color: #88ca9f;">45</span> ef                 <span style="color: #feacd0;">movzx</span> <span style="color: #6ae4b9;">eax</span>, <span style="color: #79a8ff;">byte</span> [<span style="color: #6ae4b9;">rbp</span> - var_<span style="color: #88ca9f;">19h</span>]
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x7a</span>                     <span style="color: #88ca9f;">31</span> d0                       <span style="color: #feacd0;">xor</span>   <span style="color: #6ae4b9;">eax</span>, <span style="color: #6ae4b9;">edx</span>
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x7c</span>                     <span style="color: #88ca9f;">88</span> <span style="color: #88ca9f;">45</span> ef                    <span style="color: #feacd0;">mov</span>   <span style="color: #79a8ff;">byte</span> [<span style="color: #6ae4b9;">rbp</span> - var_<span style="color: #88ca9f;">19h</span>], <span style="color: #6ae4b9;">al</span>
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x7f</span>                     <span style="color: #88ca9f;">8b</span> <span style="color: #88ca9f;">45</span> f0                    <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">eax</span>, <span style="color: #79a8ff;">dword</span> [<span style="color: #6ae4b9;">rbp</span> - var_<span style="color: #88ca9f;">18h</span>]
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x82</span>                     <span style="color: #88ca9f;">8d</span> <span style="color: #88ca9f;">50</span> <span style="color: #88ca9f;">01</span>                    <span style="color: #feacd0;">lea</span>   <span style="color: #6ae4b9;">edx</span>, [<span style="color: #6ae4b9;">rax</span> + <span style="color: #88ca9f;">1</span>]
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x85</span>                     <span style="color: #88ca9f;">89</span> <span style="color: #88ca9f;">55</span> f0                    <span style="color: #feacd0;">mov</span>   <span style="color: #79a8ff;">dword</span> [<span style="color: #6ae4b9;">rbp</span> - var_<span style="color: #88ca9f;">18h</span>], <span style="color: #6ae4b9;">edx</span>
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x88</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">63</span> d0                    <span style="color: #feacd0;">movsxd</span> <span style="color: #6ae4b9;">rdx</span>, <span style="color: #6ae4b9;">eax</span>
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x8b</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">8b</span> <span style="color: #88ca9f;">45</span> d0                 <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">rax</span>, <span style="color: #79a8ff;">qword</span> [<span style="color: #6ae4b9;">rbp</span> - var_<span style="color: #88ca9f;">38h</span>]
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x8f</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">01</span> c2                    <span style="color: #feacd0;">add</span>   <span style="color: #6ae4b9;">rdx</span>, <span style="color: #6ae4b9;">rax</span>
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x92</span>                     <span style="color: #88ca9f;">0f</span> b6 <span style="color: #88ca9f;">45</span> ef                 <span style="color: #feacd0;">movzx</span> <span style="color: #6ae4b9;">eax</span>, <span style="color: #79a8ff;">byte</span> [<span style="color: #6ae4b9;">rbp</span> - var_<span style="color: #88ca9f;">19h</span>]
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x96</span>                     <span style="color: #88ca9f;">88</span> <span style="color: #88ca9f;">02</span>                       <span style="color: #feacd0;">mov</span>   <span style="color: #79a8ff;">byte</span> [<span style="color: #6ae4b9;">rdx</span>], <span style="color: #6ae4b9;">al</span>
&#9474;  &#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x98</span>                     <span style="color: #88ca9f;">83</span> <span style="color: #88ca9f;">7d</span> f0 <span style="color: #88ca9f;">13</span>                 <span style="color: #feacd0;">cmp</span>   <span style="color: #79a8ff;">dword</span> [<span style="color: #6ae4b9;">rbp</span> - var_<span style="color: #88ca9f;">18h</span>], <span style="color: #88ca9f;">0x13</span>
&#9474; &#9484;&#9472;&#9472;&#9472;&#9472;&#9472;&lt; fcn.00001185+<span style="color: #88ca9f;">0x9c</span>                     <span style="color: #88ca9f;">7e</span> <span style="color: #88ca9f;">07</span>                       <span style="color: #feacd0;">jle</span>   <span style="color: #88ca9f;">0x122a</span>
&#9474; &#9474;&#9550;&#9474;&#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0x9e</span>                     c7 <span style="color: #88ca9f;">45</span> f0 <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span> <span style="color: #88ca9f;">00</span>        <span style="color: #feacd0;">mov</span>   <span style="color: #79a8ff;">dword</span> [<span style="color: #6ae4b9;">rbp</span> - var_<span style="color: #88ca9f;">18h</span>], <span style="color: #88ca9f;">0</span>
&#9474; &#9492;&#9472;&#9472;&#9472;&#9472;&#9472;&gt; fcn.00001185+<span style="color: #88ca9f;">0xa5</span>                     <span style="color: #88ca9f;">83</span> <span style="color: #88ca9f;">45</span> f8 <span style="color: #88ca9f;">01</span>                 <span style="color: #feacd0;">add</span>   <span style="color: #79a8ff;">dword</span> [<span style="color: #6ae4b9;">rbp</span> - var_<span style="color: #88ca9f;">10h</span>], <span style="color: #88ca9f;">1</span>
&#9474;  &#9550;&#9474;&#9550;&#9474;   <span style="color: #989898;">; </span><span style="color: #989898;">CODE XREF from fcn.00001185 @ 0x11be</span>
&#9474;  &#9550;&#9492;&#9472;&#9472;&#9472;&gt; fcn.00001185+<span style="color: #88ca9f;">0xa9</span>                     <span style="color: #88ca9f;">8b</span> <span style="color: #88ca9f;">45</span> f8                    <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">eax</span>, <span style="color: #79a8ff;">dword</span> [<span style="color: #6ae4b9;">rbp</span> - var_<span style="color: #88ca9f;">10h</span>]
&#9474;  &#9550; &#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0xac</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">63</span> d0                    <span style="color: #feacd0;">movsxd</span> <span style="color: #6ae4b9;">rdx</span>, <span style="color: #6ae4b9;">eax</span>
&#9474;  &#9550; &#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0xaf</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">8b</span> <span style="color: #88ca9f;">45</span> d8                 <span style="color: #feacd0;">mov</span>   <span style="color: #6ae4b9;">rax</span>, <span style="color: #79a8ff;">qword</span> [<span style="color: #6ae4b9;">rbp</span> - s]
&#9474;  &#9550; &#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0xb3</span>                     <span style="color: #88ca9f;">48</span> <span style="color: #88ca9f;">01</span> d0                    <span style="color: #feacd0;">add</span>   <span style="color: #6ae4b9;">rax</span>, <span style="color: #6ae4b9;">rdx</span>
&#9474;  &#9550; &#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0xb6</span>                     <span style="color: #88ca9f;">0f</span> b6 <span style="color: #88ca9f;">00</span>                    <span style="color: #feacd0;">movzx</span> <span style="color: #6ae4b9;">eax</span>, <span style="color: #79a8ff;">byte</span> [<span style="color: #6ae4b9;">rax</span>]
&#9474;  &#9550; &#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0xb9</span>                     <span style="color: #88ca9f;">84</span> c0                       <span style="color: #feacd0;">test</span>  <span style="color: #6ae4b9;">al</span>, <span style="color: #6ae4b9;">al</span>
&#9474;  &#9492;&#9472;&#9472;&#9472;&#9472;&lt; fcn.00001185+<span style="color: #88ca9f;">0xbb</span>                     <span style="color: #88ca9f;">0f</span> <span style="color: #88ca9f;">85</span> <span style="color: #88ca9f;">7a</span> ff ff ff           <span style="color: #feacd0;">jne</span>   <span style="color: #88ca9f;">0x11c0</span>
&#9474;    &#9550;&#9474;   fcn.00001185+<span style="color: #88ca9f;">0xc1</span>                     <span style="color: #88ca9f;">83</span> <span style="color: #88ca9f;">45</span> f4 <span style="color: #88ca9f;">01</span>                 <span style="color: #feacd0;">add</span>   <span style="color: #79a8ff;">dword</span> [<span style="color: #6ae4b9;">rbp</span> - var_<span style="color: #88ca9f;">14h</span>], <span style="color: #88ca9f;">1</span>
&#9474;    &#9550;&#9474;   <span style="color: #989898;">; </span><span style="color: #989898;">CODE XREF from fcn.00001185 @ 0x11b2</span>
&#9474;    &#9550;&#9492;&#9472;&gt; fcn.00001185+<span style="color: #88ca9f;">0xc5</span>                     <span style="color: #88ca9f;">83</span> <span style="color: #88ca9f;">7d</span> f4 <span style="color: #88ca9f;">04</span>                 <span style="color: #feacd0;">cmp</span>   <span style="color: #79a8ff;">dword</span> [<span style="color: #6ae4b9;">rbp</span> - var_<span style="color: #88ca9f;">14h</span>], <span style="color: #88ca9f;">4</span>
&#9474;    &#9492;&#9472;&#9472;&lt; fcn.00001185+<span style="color: #88ca9f;">0xc9</span>                     <span style="color: #88ca9f;">0f</span> <span style="color: #88ca9f;">8e</span> <span style="color: #88ca9f;">63</span> ff ff ff           <span style="color: #feacd0;">jle</span>   <span style="color: #88ca9f;">0x11b7</span>
&#9474;         fcn.00001185+<span style="color: #88ca9f;">0xcf</span>                     <span style="color: #88ca9f;">90</span>                          <span style="color: #feacd0;">nop</span>
&#9474;         fcn.00001185+<span style="color: #88ca9f;">0xd0</span>                     <span style="color: #88ca9f;">90</span>                          <span style="color: #feacd0;">nop</span>
&#9474;         fcn.00001185+<span style="color: #88ca9f;">0xd1</span>                     c9                          <span style="color: #feacd0;">leave</span>
&#9492;         fcn.00001185+<span style="color: #88ca9f;">0xd2</span>                     c3                          <span style="color: #feacd0;">ret</span>
</pre>
</div>

<p>
TODO
</p>
</div>
</div>
