reversing/reversing-keygen.org
* Alternative: Decompiling with IDA or ghidra

This option is not always reliable or not always available, so it's important to
understand how the actual assembly works before jumping into the decompiler.

There are various decompilers, and everyone has different opinions about which
one is the best. For me, even though I rather use free and open-source tools, I
find that the best decompiler is the IDA Pro one. Rizin (and therefore cutter)
has [[https://github.com/rizinorg/rz-ghidra][its own ghidra]] plugin made in C++.

I will show a comparison between these two decompilers, but keep in mind that
decompiling a single program doesn't provide nearly enough data to judge the two
decompilers.

#+begin_quote
*Note:* I formatted both outputs with [[https://github.com/8dcc/linux-dotfiles/blob/c5b5bcef1ea79397ae93accd7713616c9d6bd1ae/dotfiles/clang-format/clang-format][my clang-format]] to make the outputs look as
similar as possible.
#+end_quote

** IDA Pro

This is the generated C code by /IDA Pro Version 7.7.220118 Windows x64/ (/x64
Decompiler Hex-Rays SA 7.7.0.220118/).

#+begin_src C
size_t /* __fastcall */ sub_1185(const char* a1, __int64 a2) {
    size_t result;    // rax
    int v3;           // eax
    int v4;           // [rsp+20h] [rbp-10h]
    int i;            // [rsp+24h] [rbp-Ch]
    int j;            // [rsp+28h] [rbp-8h]
    char v7;          // [rsp+2Ch] [rbp-4h]

    result = strlen(a1);
    v7     = result;
    v4     = 0;
    for (i = 0; i <= 4; ++i) {
        for (j = 0;; ++j) {
            result = a1[j];
            if (!result)
                break;

            v3 = v4++;
            , *(a2 + v3) = v7 ^ i ^ ((16 * a1[j]) | (a1[j] >> 4));
            if (v4 > 19)
                v4 = 0;
        }
    }

    return result;
}
#+end_src

** Rizin's version of ghidra

This is the generated C code by /rizin 0.6.1 @ linux-x86-64/.

#+begin_src C
[0x00001090]> pdg @ fcn.00001189

// WARNING: Variable defined which should be unmapped: var_ch
// WARNING: Could not reconcile some variable overlaps
// WARNING: [rz-ghidra] Detected overlap for variable var_14h
// WARNING: [rz-ghidra] Detected overlap for variable var_10h
// WARNING: [rz-ghidra] Detected overlap for variable var_19h

void fcn .00001189(char* arg1, int64_t arg2) {
    int32_t iVar1;
    uint8_t uVar2;
    int64_t var_38h;
    char* s;
    int64_t var_18h;
    int32_t var_10h;
    size_t var_ch;

    uVar2         = sym.imp.strlen(arg1);
    var_18h._0_4_ = 0;
    for (var_18h._4_4_ = 0; var_18h._4_4_ < 5;
         var_18h._4_4_ = var_18h._4_4_ + 1) {
        for (var_10h = 0; arg1[var_10h] != '\0'; var_10h = var_10h + 1) {
            iVar1 = var_18h + 1;
            *(var_18h + arg2) =
              (arg1[var_10h] >> 4 | arg1[var_10h] << 4) ^ var_18h._4_4_ ^ uVar2;
            var_18h._0_4_ = iVar1;
            if (0x13 < iVar1) {
                var_18h._0_4_ = 0;
            }
        }
    }
    return;
}
#+end_src

I manually removed the type casts from rizin's output since I disabled them for
IDA.
